Занятие_12/src/DataProcessors/ЗаполнениеДанными/ЗаполнениеДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеДанными</name>
</mdclass:DataProcessor>

Занятие_12/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Занятие_12/src/Documents/ОказаниеУслуги/ОказаниеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОказаниеУслуги</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Занятие_12/src/DataProcessors/ЗаполнениеДанными/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ЗаполнитьДанные(Команда)
	ЗаполнитьДанныеНаСервере();
	Сообщить("Данные успешно заполнены!");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеНаСервере()

	// Проверка: если данные уже есть, не заполнять повторно
	Если Справочники.Клиенты.НайтиПоНаименованию("Иванов Михаил Юрьевич") <> Справочники.Клиенты.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;

	// =============================================
	// Справочник Клиенты
	// =============================================
	Клиент1 = Справочники.Клиенты.СоздатьЭлемент();
	Клиент1.Наименование = "Иванов Михаил Юрьевич";
	Клиент1.Записать();

	Клиент2 = Справочники.Клиенты.СоздатьЭлемент();
	Клиент2.Наименование = "Роман";
	Клиент2.Записать();

	// =============================================
	// Справочник Сотрудники
	// =============================================
	Сотрудник1 = Справочники.Сотрудники.СоздатьЭлемент();
	Сотрудник1.Наименование = "Гусаков Николай Дмитриевич";
	НоваяСтрока = Сотрудник1.ТрудоваяДеятельность.Добавить();
	НоваяСтрока.Организация = "ЗАО ""НТЦ""";
	НоваяСтрока.НачалоРаботы = '20170201';
	НоваяСтрока.ОкончаниеРаботы = '20220416';
	НоваяСтрока.Должность = "Ведущий специалист";
	Сотрудник1.Записать();

	Сотрудник2 = Справочники.Сотрудники.СоздатьЭлемент();
	Сотрудник2.Наименование = "Деловой Иван Сергеевич";
	НоваяСтрока = Сотрудник2.ТрудоваяДеятельность.Добавить();
	НоваяСтрока.Организация = "ООО ""Автоматизация""";
	НоваяСтрока.НачалоРаботы = '20140122';
	НоваяСтрока.ОкончаниеРаботы = '20220331';
	НоваяСтрока.Должность = "Инженер";
	НоваяСтрока = Сотрудник2.ТрудоваяДеятельность.Добавить();
	НоваяСтрока.Организация = "ЗАО ""НПО СпецСвязь""";
	НоваяСтрока.НачалоРаботы = '20040520';
	НоваяСтрока.ОкончаниеРаботы = '20140121';
	НоваяСтрока.Должность = "Начальник производства";
	Сотрудник2.Записать();

	Сотрудник3 = Справочники.Сотрудники.СоздатьЭлемент();
	Сотрудник3.Наименование = "Симонов Валерий Михайлович";
	НоваяСтрока = Сотрудник3.ТрудоваяДеятельность.Добавить();
	НоваяСтрока.Организация = "ООО ""СтройМастер""";
	НоваяСтрока.НачалоРаботы = '20170205';
	НоваяСтрока.ОкончаниеРаботы = '20200403';
	НоваяСтрока.Должность = "Прораб";
	Сотрудник3.Записать();

	// =============================================
	// Справочник Номенклатура
	// =============================================
	ГруппаРадио = Справочники.Номенклатура.СоздатьГруппу();
	ГруппаРадио.Наименование = "Радиодетали";
	ГруппаРадио.Записать();

	ГруппаПрочее = Справочники.Номенклатура.СоздатьГруппу();
	ГруппаПрочее.Наименование = "Прочее";
	ГруппаПрочее.Записать();

	Материал1 = Справочники.Номенклатура.СоздатьЭлемент();
	Материал1.Наименование = "Строчный трансформатор Samsung";
	Материал1.Родитель = ГруппаРадио.Ссылка;
	Материал1.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал;
	Материал1.Записать();

	Материал2 = Справочники.Номенклатура.СоздатьЭлемент();
	Материал2.Наименование = "Транзистор Philips 2N2369";
	Материал2.Родитель = ГруппаРадио.Ссылка;
	Материал2.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал;
	Материал2.Записать();

	Материал3 = Справочники.Номенклатура.СоздатьЭлемент();
	Материал3.Наименование = "Строчный трансформатор LG";
	Материал3.Родитель = ГруппаРадио.Ссылка;
	Материал3.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал;
	Материал3.Записать();

	Материал4 = Справочники.Номенклатура.СоздатьЭлемент();
	Материал4.Наименование = "Шланг резиновый";
	Материал4.Родитель = ГруппаПрочее.Ссылка;
	Материал4.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал;
	Материал4.Записать();

	Материал5 = Справочники.Номенклатура.СоздатьЭлемент();
	Материал5.Наименование = "Кабель электрический";
	Материал5.Родитель = ГруппаПрочее.Ссылка;
	Материал5.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал;
	Материал5.Записать();

	Услуга1 = Справочники.Номенклатура.СоздатьЭлемент();
	Услуга1.Наименование = "Ремонт телевизора";
	Услуга1.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга;
	Услуга1.Записать();

	Услуга2 = Справочники.Номенклатура.СоздатьЭлемент();
	Услуга2.Наименование = "Установка стиральной машины";
	Услуга2.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга;
	Услуга2.Записать();

	ОсновнойСклад = Справочники.Склады.Основной;

	// =============================================
	// Приходная накладная N1 (ремонт телевизоров)
	// =============================================
	Док1 = Документы.ПриходнаяНакладная.СоздатьДокумент();
	Док1.Дата = ТекущаяДата();
	Док1.Склад = ОсновнойСклад;

	Строка = Док1.Материалы.Добавить();
	Строка.Материал = Материал1.Ссылка;
	Строка.Количество = 10;
	Строка.Цена = 500;
	Строка.Сумма = 5000;

	Строка = Док1.Материалы.Добавить();
	Строка.Материал = Материал2.Ссылка;
	Строка.Количество = 20;
	Строка.Цена = 50;
	Строка.Сумма = 1000;

	Строка = Док1.Материалы.Добавить();
	Строка.Материал = Материал3.Ссылка;
	Строка.Количество = 5;
	Строка.Цена = 450;
	Строка.Сумма = 2250;

	Док1.Записать(РежимЗаписиДокумента.Проведение);

	// =============================================
	// Приходная накладная N2 (установка стиральных машин)
	// =============================================
	Док2 = Документы.ПриходнаяНакладная.СоздатьДокумент();
	Док2.Дата = ТекущаяДата();
	Док2.Склад = ОсновнойСклад;

	Строка = Док2.Материалы.Добавить();
	Строка.Материал = Материал4.Ссылка;
	Строка.Количество = 5;
	Строка.Цена = 200;
	Строка.Сумма = 1000;

	Строка = Док2.Материалы.Добавить();
	Строка.Материал = Материал5.Ссылка;
	Строка.Количество = 10;
	Строка.Цена = 100;
	Строка.Сумма = 1000;

	Док2.Записать(РежимЗаписиДокумента.Проведение);

	// =============================================
	// Оказание услуги N1
	// =============================================
	Док3 = Документы.ОказаниеУслуги.СоздатьДокумент();
	Док3.Дата = ТекущаяДата();
	Док3.Склад = ОсновнойСклад;
	Док3.Клиент = Клиент1.Ссылка;
	Док3.Мастер = Сотрудник1.Ссылка;

	Строка = Док3.ПереченьНоменклатуры.Добавить();
	Строка.Номенклатура = Материал1.Ссылка;
	Строка.Количество = 1;
	Строка.Цена = 1000;
	Строка.Сумма = 1000;
	Строка.Стоимость = 500;

	Строка = Док3.ПереченьНоменклатуры.Добавить();
	Строка.Номенклатура = Материал2.Ссылка;
	Строка.Количество = 2;
	Строка.Цена = 100;
	Строка.Сумма = 200;
	Строка.Стоимость = 50;

	Строка = Док3.ПереченьНоменклатуры.Добавить();
	Строка.Номенклатура = Услуга1.Ссылка;
	Строка.Количество = 1;
	Строка.Цена = 5000;
	Строка.Сумма = 5000;
	Строка.Стоимость = 0;

	Док3.Записать(РежимЗаписиДокумента.Проведение);

	// =============================================
	// Регистр сведений Цены
	// =============================================
	МенеджерЗаписи = РегистрыСведений.Цены.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Номенклатура = Материал1.Ссылка;
	МенеджерЗаписи.Цена = 1000;
	МенеджерЗаписи.Записать();

	МенеджерЗаписи = РегистрыСведений.Цены.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Номенклатура = Материал2.Ссылка;
	МенеджерЗаписи.Цена = 100;
	МенеджерЗаписи.Записать();

	МенеджерЗаписи = РегистрыСведений.Цены.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Номенклатура = Материал3.Ссылка;
	МенеджерЗаписи.Цена = 900;
	МенеджерЗаписи.Записать();

	МенеджерЗаписи = РегистрыСведений.Цены.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Номенклатура = Материал4.Ссылка;
	МенеджерЗаписи.Цена = 200;
	МенеджерЗаписи.Записать();

	МенеджерЗаписи = РегистрыСведений.Цены.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Номенклатура = Материал5.Ссылка;
	МенеджерЗаписи.Цена = 100;
	МенеджерЗаписи.Записать();

КонецПроцедуры
